Repository: Ashreeef/ate_app
Catalog: lib/l10n/app_*.arb
Languages: ar

# appTitle
source: Ate
ar: أكل

# loginTitle
source: Welcome Back
ar: مرحباً بعودتك

# loginButton
source: Sign In
ar: تسجيل الدخول

# signupButton
source: Sign Up
ar: إنشاء حساب

# emailLabel
source: Email Address
ar: البريد الإلكتروني

# passwordLabel
source: Password
ar: كلمة المرور

# usernameLabel
source: Username
ar: اسم المستخدم

source: Forgot Password?
ar: نسيت كلمة المرور؟

# dontHaveAccount
source: Don't have an account?
ar: ليس لديك حساب؟

# alreadyHaveAccount
source: Already have an account?
ar: لديك حساب بالفعل؟

# feedTitle
source: Discover
ar: اكتشف

# searchPlaceholder
source: Search restaurants, dishes...
ar: ابحث عن المطاعم والأطباق...

# createPostTitle
source: Share Your Experience
ar: شارك تجربتك

# profileTitle
source: Profile
ar: الملف الشخصي

# settingsTitle
source: Settings
ar: الإعدادات

# challengesTitle
source: Challenges
ar: التحديات

source: Edit Profile
ar: تعديل الملف الشخصي

source: Logout
ar: تسجيل الخروج

source: Posts
ar: المنشورات

source: Followers
ar: المتابعون

source: Following
ar: المتابَعون

source: Points
ar: نقاط

source: Saved
ar: المحفوظات

source: My Posts
ar: منشوراتي

source: Saved Posts
ar: المنشورات المحفوظة

source: Like
ar: إعجاب

source: Comment
ar: تعليق

source: Share
ar: مشاركة

source: Save
ar: حفظ

source: Cancel
ar: إلغاء

source: Submit
ar: إرسال

source: Loading...
ar: جاري التحميل...

source: Error
ar: خطأ

source: Coming soon!
ar: قريباً!

# profileUpdated
source: Profile updated successfully
ar: تم تحديث الملف الشخصي بنجاح

source: Delete account
ar: حذف الحساب

# logoutSuccess
source: Logged out successfully
ar: تم تسجيل الخروج بنجاح

source: Share profile
ar: مشاركة الملف الشخصي

source: Change Password
ar: تغيير كلمة المرور

source: Current password
ar: كلمة المرور الحالية

source: New password
ar: كلمة المرور الجديدة

# confirmPassword
source: Confirm new password
ar: تأكيد كلمة المرور الجديدة

source: Passwords do not match
ar: كلمات المرور غير متطابقة

# passwordTooShort
source: Password must be at least 6 characters
ar: يجب أن تحتوي كلمة المرور على 6 أحرف على الأقل

# passwordChangedSuccess
source: Password changed successfully
ar: تم تغيير كلمة المرور بنجاح

# passwordChangeError
source: Error changing password
ar: خطأ في تغيير كلمة المرور

# incorrectPassword
source: Current password is incorrect
ar: كلمة المرور الحالية غير صحيحة

source: Choose Language
ar: اختر اللغة

source: Help & Support
ar: المساعدة والدعم

source: 📞 Contact Us
ar: 📞 تواصل معنا

# emailSupport
source: Email: Contact.ate.app@gmail.com
ar: البريد الإلكتروني: support@ate-app.com

# supportHours
source: Response time: Usually within 24h
ar: الدعم: الإثنين-الجمعة 9 صباحاً-6 مساءً

# frequentlyAsked
source: Frequently Asked Questions
ar: الأسئلة الشائعة

# howToEditProfile
source: How to edit my profile?
ar: كيف أعدل ملفي الشخصي؟

# howToEditProfileAnswer
source: Go to Profile > Edit Profile to update your personal information.
ar: اذهب إلى الإعدادات > تعديل الملف الشخصي لتغيير معلوماتك الشخصية.

# howToFollowUsers
source: How to follow other users?
ar: كيف أتابع مستخدمين آخرين؟

# howToFollowUsersAnswer
source: Visit their profile and tap the 'Follow' button.
ar: قم بزيارة ملفهم الشخصي واضغط على زر 'متابعة'.

# howToPostPhoto
source: How to share a culinary moment?
ar: كيف أنشر صورة؟

# howToPostPhotoAnswer
source: Tap the '+' button at the bottom of the screen to share your experience.
ar: اضغط على زر '+' في أسفل الشاشة، اختر صورة وأضف وصفاً.

source: How to report content?
ar: كيف أبلغ عن محتوى؟

# howToReportContentAnswer
source: Tap the three dots on any post and select 'Report'.
ar: اضغط على النقاط الثلاث على المنشور واختر 'إبلاغ'.

# forgotPasswordHelp
source: Lost your password?
ar: نسيت كلمة المرور؟

# forgotPasswordHelpAnswer
source: Use the 'Forgot Password' link on the login screen to reset it.
ar: استخدم رابط 'نسيت كلمة المرور' في شاشة تسجيل الدخول.

source: ✨ Main Features
ar: الميزات الرئيسية

# shareculinaryMoments
source: • Share your culinary moments
ar: • شارك لحظاتك الطبخية

# followFriends
source: • Follow friends and discover new profiles
ar: • تابع أصدقائك واكتشف ملفات جديدة

# likeComment
source: • Like and comment on posts
ar: • أعجب وعلق على المنشورات

# savePosts
source: • Save your favorite posts
ar: • احفظ منشوراتك المفضلة

# pointsSystem
source: • Points and levels system
ar: • نظام النقاط والمستويات

# discoverRestaurants
source: • Discover new restaurants
ar: • اكتشف مطاعم جديدة

source: Dark mode
ar: الوضع الداكن

source: Troubleshooting
ar: حل المشاكل

# restartApp
source: • Restart the app if you encounter issues
ar: • أعد تشغيل التطبيق إذا تصرف بشكل غريب

# checkInternet
source: • Ensure you have an active internet connection
ar: • تحقق من اتصال الإنترنت

# updateApp
source: • Update to the latest version via Store
ar: • حدث إلى أحدث إصدار

# clearCache
source: • Clear app cache if needed
ar: • امسح التخزين المؤقت في الإعدادات

# contactSupport
source: • Contact support via email if issues persist
ar: • تواصل مع الدعم إذا استمرت المشكلة

# closeDialog
source: Close
ar: إغلاق

source: 🍽️ About Ate
ar: حول Ate

# appDescription
source: Ate is your ultimate culinary companion! Share your gastronomic experiences, discover new restaurants and connect with other food enthusiasts.
ar: Ate هو رفيقك الطبخي النهائي! شارك تجاربك الغذائية، اكتشف مطاعم جديدة وتواصل مع عشاق الطعام الآخرين.

source: Our Mission
ar: مهمتنا

# missionDescription
source: Connecting food lovers and making every meal memorable by creating a vibrant community.
ar: ربط محبي الطعام وجعل كل وجبة لا تُنسى من خلال إنشاء مجتمع محب حول شغف الطبخ.

source: What We Offer
ar: ما نقدمه

# shareFoodPhotos
source: • Share photos of your favorite dishes
ar: • مشاركة صور أطباقك المفضلة

# discoverNewRestaurants
source: • Discover hidden gems
ar: • اكتشاف مطاعم جديدة

source: • Personalized recommendations
ar: • نظام توصيات شخصية

source: • Active community
ar: • مجتمع نشط من محبي الطعام

# intuitiveInterface
source: • Modern and intuitive interface
ar: • واجهة بديهية وحديثة

# privacyRespect
source: • Respect for your privacy
ar: • احترام خصوصيتك

source: The Team
ar: الفريق

# teamDescription
source: Developed with ❤️ by the Ate team.
ar: تم التطوير بـ ❤️ من قبل فريق شغوف بالتكنولوجيا والطبخ، مقره في الجزائر.

# versionInfo
source: Version 1.0.0
ar: الإصدار 1.0.0

# buildInfo
source: Build 2026.01.08
ar: البناء: 2026.01.01

# allRightsReserved
source: © 2026 Ate App. All rights reserved.
ar: © 2025 أكل. جميع الحقوق محفوظة.

source: Made in Algeria 🇩🇿
ar: صُنع في الجزائر 🇩🇿

source: Privacy & Security
ar: الخصوصية والأمان

source: Private Account
ar: حساب خاص

# privateAccountDesc
source: Only followers can see your profile
ar: سيكون ملفك الشخصي مرئيًا فقط لمتابعيك

source: Show Online Status
ar: إظهار حالة الاتصال

# showOnlineStatusDesc
source: Let others see when you are active
ar: يمكن للآخرين رؤية متى تكون متصلاً

source: Close
ar: إغلاق

source: Need help?
ar: هل تحتاج إلى مساعدة؟

source: Phone
ar: الهاتف

source: About
ar: حول

# version
source: Version 1.0.0
ar: الإصدار 1.0.0

source: Terms & Privacy
ar: الشروط والخصوصية

source: Terms of Use
ar: شروط الاستخدام

# termsOfUseDesc
source: By using Ate, you accept our terms of use.
ar: باستخدام أكل، فإنك توافق على شروط الاستخدام وسياسة الخصوصية الخاصة بنا.

source: Privacy Policy
ar: سياسة الخصوصية

# privacyPolicyDesc
source: Your data is safe and protected with us.
ar: بياناتك الشخصية محمية ولن يتم مشاركتها مع أطراف ثالثة دون موافقتك.

source: Data Collection
ar: جمع البيانات

# dataCollectionDesc
source: • Profile info\n• Photos and posts\n• Interaction data
ar: • معلومات الملف الشخصي • الصور والمنشورات • بيانات التفاعل

# accountDeleted
source: Account deleted successfully
ar: تم حذف الحساب بنجاح

# logoutConfirm
source: Are you sure you want to log out?
ar: هل أنت متأكد أنك تريد تسجيل الخروج؟

# deleteAccountConfirm
source: This action is irreversible. All data will be deleted.
ar: هذا الإجراء لا رجعة فيه. سيتم حذف جميع بياناتك نهائيًا.

source: Account
ar: الحساب

# updateYourInfo
source: Update your information
ar: تحديث معلوماتك

# manageAccountSecurity
source: Manage security
ar: إدارة أمان حسابك

# updateYourPassword
source: Update password
ar: تحديث كلمة المرور

source: Preferences
ar: التفضيلات

source: Manage notifications
ar: إدارة تفضيلات الإشعارات

source: Notifications
ar: الإشعارات

source: Language
ar: اللغة

source: Theme
ar: المظهر

source: Support
ar: الدعم

# getHelpWithApp
source: Get help
ar: احصل على المساعدة مع أكل

# learnMoreAboutApp
source: Learn more about Ate
ar: معرفة المزيد عن أكل

source: Legal info
ar: المعلومات القانونية

source: Danger Zone
ar: منطقة الخطر

# logoutFromAccount
source: Log out
ar: تسجيل الخروج من حسابك

# deleteAccountPermanently
source: Delete permanently
ar: حذف حسابك نهائيًا

# pickImages
source: Pick images (max 3)
ar: اختر الصور (بحد أقصى 3)

# noPosts
source: No posts yet
ar: لا توجد منشورات حتى الآن

# noPostsDescription
source: Be the first to share your culinary experience!
ar: كن أول من يشارك تجربتك الطهي!

source: Select at least one image
ar: حدد صورة واحدة على الأقل

# imageSelectionFailed
source: Failed to select image: {error}
ar: فشل اختيار الصورة: {error}

# postPublished
source: Post published successfully!
ar: تم نشر المنشور بنجاح!

# writeCaption
source: Please write a caption
ar: يرجى كتابة تعليق

# enterRestaurant
source: Please enter restaurant name
ar: يرجى إدخال اسم المطعم

# rateExperience
source: Rate your experience
ar: قيم تجربتك

source: Caption
ar: التعليق

# captionPlaceholder
source: Share your culinary experience...
ar: شارك تجربتك الطهي...

source: Restaurant
ar: المطعم

# restaurantHint
source: Search restaurants...
ar: ابحث عن مطعم...

source: Dish Name
ar: اسم الطبق

# dishNamePlaceholder
source: e.g. Royal Couscous, Grilled Fish...
ar: مثال: كسكس ملكي، سمك مشوي...

source: Dish Name (Optional)
ar: (اختياري)

source: Your Rating
ar: تقييمك

source: New Post
ar: منشور جديد

source: Publish
ar: نشر

source: Disappointing
ar: مخيب للآمال

source: Fair
ar: متوسط

source: Good
ar: جيد

source: Very Good
ar: جيد جداً

source: Excellent
ar: ممتاز!

source: My Feed
ar: تغذيتي

# friendsFeed
source: Friends
ar: الأصدقاء

source: Search
ar: بحث

source: Search restaurants...
ar: ابحث عن المطاعم...

source: Trending Near You
ar: الرائج بالقرب منك

source: Recent Searches
ar: عمليات البحث الأخيرة

source: See All
ar: عرض الكل

source: All Restaurants
ar: جميع المطاعم

source: Results
ar: النتائج

# resultsFor
source: Results for "{query}"
ar: نتائج لـ "{query}"

source: No restaurants available
ar: لا توجد مطاعم متاحة

source: No results found
ar: لم يتم العثور على نتائج

source: Try other keywords
ar: جرب كلمات مفتاحية أخرى

source: Restaurant not found
ar: المطعم غير موجود

source: Menu
ar: القائمة

source: Rating
ar: التقييم

source: Next
ar: التالي

source: Gallery
ar: المعرض

source: Take Photo
ar: التقط صورة

source: Select Photos
ar: اختر الصور

# maxImagesMessage
source: You can only select {maxImages} images
ar: يمكنك اختيار ما يصل إلى {maxImages} صور

# imageSelectionError
source: Failed to pick image: {error}
ar: فشل اختيار الصورة: {error}

# selectAtLeastOne
source: Select at least one image
ar: يرجى اختيار صورة واحدة على الأقل

source: Comments
ar: التعليقات

source: Report
ar: إبلاغ

source: Copy link
ar: نسخ الرابط

source: Follow
ar: متابعة

source: Post
ar: منشور

# addComment
source: Add a comment...
ar: أضف تعليقاً...

# imageLoadFailed
source: Failed to load image
ar: فشل تحميل الصورة

# linkCopied
source: Link copied to clipboard!
ar: تم نسخ الرابط إلى الحافظة

# hoursAgo
source: {count}h ago
ar: منذ {hours} ساعة

source: Reviews
ar: التقييمات

# timeToEat
source: It's time to eat!
ar: حان وقت الأكل!

# loginSubtitle
source: Sign in to find your friends, discover new dishes, and share your delicious moments.
ar: قم بتسجيل الدخول للعثور على أصدقائك واكتشاف أطباق جديدة ومشاركة لحظاتك اللذيذة.

source: Remember me
ar: تذكرني

source: Logging In...
ar: جاري تسجيل الدخول...

# signInButton
source: Sign In
ar: تسجيل الدخول

# forgotPasswordTitle
source: Forgot Password?
ar: نسيت كلمة المرور؟

# forgotPasswordSubtitle
source: Don't worry! Enter your email address below and we will send you a link to reset your password.
ar: لا تقلق! أدخل عنوان بريدك الإلكتروني وسنرسل لك رابطًا لإعادة تعيين كلمة المرور الخاصة بك.

source: Reset Password
ar: إعادة تعيين

# rememberPasswordQuestion
source: Remember your password?
ar: تتذكر كلمة المرور الخاصة بك؟

# signInLink
source: Sign In
ar: تسجيل الدخول

# welcomeToCommunity
source: Welcome to the Ate Community!
ar: مرحبًا بك في مجتمع Ate!

# signupSubtitle
source: Create your profile and start exploring your friends' favorite dishes — discover, share, and savor every moment.
ar: أنشئ ملفك الشخصي وابدأ في استكشاف أطباق أصدقائك المفضلة — اكتشف وشارك واستمتع بكل لحظة.

source: Full Name
ar: الاسم الكامل

source: Email
ar: البريد الإلكتروني

source: Password
ar: كلمة المرور

# forgotPasswordQuestion
source: Forgot Password?
ar: نسيت كلمة المرور؟

# registeringAccount
source: Registering...
ar: جاري التسجيل...

source: Sign Up
ar: إنشاء حساب

source: Continue With
ar: المتابعة مع

# alreadyHaveAccountQuestion
source: Already have an account?
ar: هل لديك حساب بالفعل؟

# signInNow
source: Sign In
ar: تسجيل الدخول

source: Profile
ar: الملف الشخصي

source: Followed!
ar: تتم المتابعة !

source: Username
ar: اسم المستخدم

source: Bio
ar: نبذة

# deleteAccountWarning
source: Danger! This will delete everything.
ar: هذا الإجراء لا رجعة فيه. سيتم حذف جميع بياناتك نهائيًا.

# closeButton
source: Close
ar: إغلاق

# noNotifications
source: No notifications yet
ar: لا توجد إشعارات بعد

# minutesAgo
source: {count}m ago
ar: منذ {minutes} دقيقة

# daysAgo
source: {count}d ago
ar: منذ {days} يوم

# noFollowers
source: No followers yet
ar: لا يوجد متابعون بعد

# noFollowing
source: No following yet
ar: لا تتابع أي شخص بعد

# continueWithSocial
source: Or continue with
ar: المتابعة عبر

# noAccount
source: Don't have an account?
ar: ليس لديك حساب؟

source: Create Account
ar: إنشاء حساب

source: Choose Photo
ar: اختر صورة

source: Add Photos
ar: إضافة صور

# shareYourCulinaryExperience
source: Share your culinary experience with beautiful photos
ar: شارك تجربتك الطهوية مع صور جميلة

source: Add
ar: إضافة

source: Trending
ar: رائج

source: Mentions
ar: الإشارات

source: Location not specified
ar: الموقع غير محدد

# activeChallengesLabel
source: Active Challenges
ar: التحديات النشطة

# allChallengesLabel
source: All Challenges
ar: جميع التحديات

source: No challenges available
ar: لا توجد تحديات متاحة

# newChallengesWillAppear
source: New challenges will appear here
ar: ستظهر التحديات الجديدة هنا

source: Mark all as read
ar: تعليم الكل كمقروء

source: Delete Post?
ar: حذف المنشور؟

# deletePostConfirm
source: This action cannot be undone.
ar: هذا الإجراء لا يمكن التراجع عنه.

source: Post deleted
ar: تم حذف المنشور

# failedToDeletePost
source: Failed to delete: {error}
ar: فشل حذف المنشور: {error}

# failedToAddComment
source: Failed to add comment: {error}
ar: فشل إضافة التعليق: {error}

source: Failed to update like
ar: فشل تحديث الإعجاب

source: Failed to update save
ar: فشل تحديث الحفظ

source: Cannot add comment
ar: لا يمكن إضافة تعليق لهذا المنشور

source: No comments yet
ar: لا توجد تعليقات بعد. كن أول من يعلق!

# likesCountText
source: {count} likes
ar: {count} إعجاب

source: Image not found
ar: الصورة غير موجودة

source: User
ar: مستخدم

# deleteAction
source: Delete
ar: حذف

source: Unknown
ar: غير معروف

# postsCount
source: {count} Posts
ar: {count} منشورات

# followersCount
source: {count} Followers
ar: {count} متابعين

# followingCount
source: {count} Following
ar: {count} يتابعهم

# pointsCount
source: {count} Points
ar: {count} نقاط

source: Likes
ar: تسجيلات الإعجاب

# noDishes
source: No dishes found
ar: لم يتم العثور على أطباق

source: No posts yet
ar: لا توجد منشورات حتى الآن

# newFollowerTitle
source: New Follower
ar: متابع جديد

# startedFollowingYou
source: {username} followed you
ar: {username} بدأ في متابعتك

# newLikeTitle
source: New Like
ar: إعجاب جديد

# likedYourPost
source: {username} liked your post
ar: {username} أعجب بمنشورك

# newCommentTitle
source: New Comment
ar: تعليق جديد

# commentedOnYourPost
source: {username} commented on your post
ar: {username} علق على منشورك

source: All caught up
ar: لقد شاهدت كل شيء!

source: Retry
ar: إعادة المحاولة

source: Just now
ar: الآن

source: Convert to Restaurant
ar: تحويل إلى مطعم

# viewRestaurant
source: View My Restaurant
ar: عرض مطعمي

source: Create Challenge
ar: إنشاء تحدي

source: Challenge Title
ar: عنوان التحدي

source: Challenge Description
ar: وصف التحدي

source: Target Count
ar: الهدف المطلوب

source: Reward Badge
ar: شارة المكافأة

source: Join Challenge
ar: الانضمام للتحدي

source: Leave Challenge
ar: مغادرة التحدي

source: Your Progress
ar: تقدمك

source: Days Remaining
ar: الأيام المتبقية

source: Challenge Ended
ar: انتهى التحدي

source: Reward
ar: المكافأة

source: Date Range
ar: الفترة الزمنية

source: Start Date
ar: تاريخ البدء

source: End Date
ar: تاريخ الانتهاء

# conversionWarning
source: This action cannot be undone.
ar: هذا الإجراء لا يمكن التراجع عنه. بمجرد التحويل إلى حساب مطعم، لن تتمكن من العودة إلى حساب مستخدم عادي.

source: Confirm Conversion
ar: تأكيد التحويل

# conversionSuccessful
source: Successfully converted to restaurant!
ar: تم التحويل إلى حساب مطعم بنجاح!

source: Become a Restaurant
ar: كن مطعماً

# fillInRestaurantDetails
source: Fill details below
ar: املأ تفاصيل مطعمك أدناه

source: Restaurant Name
ar: اسم المطعم *

source: Cuisine Type
ar: نوع المطبخ

source: Hours
ar: ساعات العمل

source: Convert Now
ar: تحويل الآن

source: Create New Challenge
ar: إنشاء تحدي جديد

# challengeInfo
source: Users earn points by posting about your restaurant
ar: سيكسب المستخدمون نقاطاً عند النشر عن مطعمك

source: Restaurant name required
ar: اسم المطعم مطلوب

# restaurantNameTooShort
source: Name too short
ar: يجب أن يحتوي اسم المطعم على 3 أحرف على الأقل

source: Cuisine type required
ar: نوع المطبخ مطلوب

source: Location required
ar: الموقع مطلوب

source: Enter restaurant name
ar: أدخل اسم المطعم

# enterCuisineType
source: e.g. Italian, Chinese
ar: مثال: إيطالي، صيني، فرنسي

source: Enter location
ar: أدخل موقع المطعم

# enterHours
source: e.g. Mon-Fri 9am-10pm
ar: مثال: الإثنين-الجمعة: 9ص-10م

# enterDescription
source: Describe the challenge...
ar: أخبرنا عن مطعمك

source: Do you want to continue?
ar: هل تريد المتابعة؟

source: Confirm
ar: تأكيد

# errorOccurred
source: An error occurred
ar: حدث خطأ

source: Challenge Type
ar: نوع التحدي

# enterChallengeTitle
source: e.g. "Try 5 Dishes"
ar: مثال: "جرب 5 أطباق"

# enterTargetCount
source: e.g. 5
ar: مثال: 5 (عدد المنشورات المطلوبة)

# enterRewardBadge
source: e.g. "Foodie Explorer 🍕"
ar: مثال: "مستكشف الطعام 🍕"

# titleRequired
source: Title is required
ar: العنوان مطلوب

source: Title too short
ar: يجب أن يحتوي العنوان على 5 أحرف على الأقل

# descriptionRequired
source: Description is required
ar: الوصف مطلوب

# targetCountRequired
source: Target count is required
ar: الهدف مطلوب

# invalidTargetCount
source: Invalid count
ar: يجب أن يكون على الأقل 1

# targetCountTooHigh
source: Max 100
ar: يجب أن يكون 100 أو أقل

# rewardBadgeRequired
source: Reward badge is required
ar: شارة المكافأة مطلوبة

source: Challenge Details
ar: تفاصيل التحدي

source: Location
ar: الموقع

source: Description
ar: الوصف

source: Edit Restaurant
ar: تعديل المطعم

# restaurantUpdatedSuccess
source: Restaurant updated successfully
ar: تم تحديث المطعم بنجاح

source: Add Cover Photo
ar: إضافة صورة غلاف

# uploadImageFail
source: Upload failed: {error}
ar: فشل رفع الصورة: {error}

source: Manage Menu
ar: إدارة القائمة

source: Delete Dish?
ar: حذف الطبق؟

# deleteDishConfirm
source: Delete "{name}"?
ar: هل أنت متأكد من حذف "{name}"؟

source: Delete
ar: حذف

source: Add First Dish
ar: إضافة أول طبق

source: Could not load menu
ar: تعذر تحميل القائمة

# menuEmpty
source: Menu is empty
ar: لا توجد أطباق بعد

source: Edit Dish
ar: تعديل الطبق

source: Add Dish
ar: إضافة طبق

source: Add Dish Photo
ar: إضافة صورة للطبق

source: Price
ar: السعر

source: Category
ar: الفئة (مثال: مقبلات، رئيسي)

# dishDescription
source: Description
ar: الوصف

# challengeTypeGeneral
source: General
ar: عام

# challengeTypeRestaurant
source: Restaurant
ar: خاص بالمطعم

# challengeTypeDish
source: Dish
ar: خاص بالطبق

# challengeTypeLocation
source: Location
ar: حسب الموقع

source: Please login first
ar: يرجى تسجيل الدخول أولاً

# selectStartEndDates
source: Select dates
ar: يرجى اختيار تاريخ البدء والانتهاء

# selectChallenge
source: Select a challenge
ar: اختر تحدياً للمساهمة فيه

source: None
ar: لا يوجد

# pleaseLoginToJoinChallenges
source: Login to join
ar: يرجى تسجيل الدخول للانضمام إلى التحديات

source: Write Review
ar: اكتب تقييمًا

source: Field required
ar: هذا الحقل مطلوب

source: Opening Hours
ar: ساعات العمل

# reviewSuccess
source: Review submitted!
ar: تم إرسال التقييم بنجاح!

source: Your Review
ar: تقييمك

# writeReviewHint
source: Share details...
ar: شارك تفاصيل تجربتك...

# noReviewsRow
source: No reviews yet
ar: لا توجد تقييمات بعد. كن أول من يقيم!

source: Failed to load reviews
ar: فشل تحميل التقييمات

# onboardingDiscover
source: Discover
ar: اكتشف

# onboardingFlavor
source: flavor
ar: النكهة

# onboardingOf
source: of
ar: الحقيقية لـ

# onboardingSharing
source: sharing
ar: المشاركة

# onboardingWith
source: with
ar: مع

# onboardingDescription
source: Ate is your food companion.
ar: أكل هو رفيقك في الطعام، مصمم لعشاق الأكل الجيد. كل يوم، استكشف أطباقاً جديدة بفضل توصيات أصدقائك، وشارك اكتشافاتك، وخُض تحديات الطعام واكسب الجوائز.

# memberLevel
source: {level} Member ⭐
ar: عضو {level} ⭐

source: Rank
ar: الرتبة

source: User points
ar: نقاط المستخدم

# followedUser
source: Followed {username}
ar: أنت تتبع {username} الآن

# unfollowedUser
source: Unfollowed {username}
ar: لقد ألغيت متابعة {username}

# conversionWarningCompact
source: Cannot be undone!
ar: لا يمكن التراجع عن هذا الإجراء!
